/*
 * MLX90316.h
 *
 * Created: 26.09.2014 19:25:13
 *  Author: Администратор
 */ 


#ifndef MLX90316_H_
#define MLX90316_H_
//---------------------------------------------------------------------------------------
#define F_CPU 16000000UL // or whatever may be your frequency
//---------------------------------------------------------------------------------------
#include <avr/io.h>
#include <util/delay.h>
//---------------------------------------------------------------------------------------
#include "setting/setting_stand.h"
//---------------------------------------------------------------------------------------
#define SENS_ANGLE_CLK			3UL  //	Тактовий сигнал для опорного датчика
#define SENS_ANGLE_DATA			7UL  //	Шлемо дані в опорний датчик
#define SENS_ANGLE_CS			4UL  //	Вибір кристала опорного датчика
//---------------------------------------------------------------------------------------
#define CS_HI					(PORTG|=(1<<SENS_ANGLE_CS));
#define CS_LO					(PORTG&=~(1<<SENS_ANGLE_CS));
#define CLK_HI					(PORTG|=(1<<SENS_ANGLE_CLK));
#define CLK_LO					(PORTG&=~(1<<SENS_ANGLE_CLK));
#define DATA_HI					(PORTB|=(1<<SENS_ANGLE_DATA));
#define DATA_LO					(PORTB&=~(1<<SENS_ANGLE_DATA));
#define DATA_IN					(DDRB&=~(1<<SENS_ANGLE_DATA));
#define DATA_OUT				(DDRB|=(1<<SENS_ANGLE_DATA));
#define GET_DATA				(((PINB)>>(SENS_ANGLE_DATA))&1)
//---------------------------------------------------------------------------------------
#if ((_MLX_ == 1)&(_TLE_ == 0))
//---------------------------------------------------------------------------------------
/**************************************************************************
*   Function name : sens_send_data
*   Returns :       нема
*   Parameters :    нема
*   Purpose :       Відправка байта на опорний датчик
****************************************************************************/
void sens_send_data(unsigned char data);
/**************************************************************************
*   Function name : sens_get_angle
*   Returns :       кут отриманий від опорного датчика
*   Parameters :    нема
*   Purpose :       Функція зчитування опорного датчика
****************************************************************************/
unsigned int get_angle(void);
//---------------------------------------------------------------------------------------
#elif ((_MLX_ == 0)&(_TLE_ == 1))
//---------------------------------------------------------------------------------------
/**************************************************************************
*   Function name : sens_send_data
*   Returns :       нема
*   Parameters :    нема
*   Purpose :       Відправка байта на опорний датчик
****************************************************************************/
void sens_send_data(unsigned int data);
/**************************************************************************
*   Function name : sens_get_angle
*   Returns :       кут отриманий від опорного датчика
*   Parameters :    нема
*   Purpose :       Функція зчитування опорного датчика
****************************************************************************/
unsigned int get_angle(void);
//---------------------------------------------------------------------------------------
#endif
/**************************************************************************
*   Function name : sens_get_average_angle
*   Returns :       кут отриманий від опорного датчика
*   Parameters :    нема
*   Purpose :       Функція зчитування середнього арифметичного з 4х вимірів опорного датчика
****************************************************************************/
unsigned long int get_average_angle(void);
//***************************************************************************************
//***************************************************************************************
//***************************************************************************************
#endif /* MLX90316_H_ */