/*
 * stepper_motor.h
 *
 * Created: 06.10.2014 16:09:14
 *  Author: Администратор
 */ 


#ifndef STEPPER_MOTOR_H_
#define STEPPER_MOTOR_H_
//---------------------------------------------------------------------------------------
#define F_CPU 16000000UL // or whatever may be your frequency
//---------------------------------------------------------------------------------------
#include <util/delay.h>
//---------------------------------------------------------------------------------------
#include "../../setting_stand.h"
#include "../measuring/reference_sensor/ref_angle_sensor.h"
//---------------------------------------------------------------------------------------
#define sin_step				1UL	//шаг опроса тыблицы синуса для двигателя
//---------------------------------------------------------------------------------------
//Двигун
//---------------------------------------------------------------------------------------
//порт, к которому подключены кнопки
#define PORT_MOTOR	 			PORTD
#define PIN_MOTOR 				PIND
#define DDRX_MOTOR				DDRD
//---------------------------------------------------------------------------------------
#define EN                      0UL  // Тактовий сигнал для драйвера двигуна
#define CTRL                    1UL  // Пов шв спад тока
#define HALF_FULL               2UL  // При 0 повний крок при 1 пів кроку
#define direct                  3UL  // Напрям при 0 проти год. стрілки при 1 за год. стрілкою
#define CLOCK                   4UL  // Між МК і дравером треба поставити R=2.2K При 0 стоп двигун(силовы ключі вимкнуті) при 1 працює драйвер
#define PWM1                    5UL  //
#define RST                     5UL  // Скидання драйвера
#define PWM2                    6UL  //
#define driver_delay			_delay_us(50) //Задержка на шагание двигателем
//---------------------------------------------------------------------------------------
/**************************************************************************
*   Function name : stepper_motor_init
*   Returns :       
*   Parameters :    
*   Purpose :       Настройка управляючих сигналів і запуск шим для мікрошагового режиму
****************************************************************************/
void stepper_motor_init(void);
/**************************************************************************
*   Function name : set_axle_to
*   Returns :       Кількість кроків які зробив двигун
*   Parameters :    заданий кут
*   Purpose :       Ставимо вісь стенда в заданий кут
****************************************************************************/
void set_axle_to(unsigned int angle);
/**************************************************************************
*   Function name : rotate
*   Returns :       нет
*   Parameters :    Кількість кроків і напряток руху
*   Purpose :       
****************************************************************************/
void rotate(unsigned char temp_vector, unsigned int temp_step);
/**************************************************************************
*   Function name : preset_drivers
*   Returns :       нет
*   Parameters :    нет
*   Purpose :       Конфігуримо драйвер крокового двигуна і стаємо в нуль стенда
****************************************************************************/
void preset_drivers(void);
//***************************************************************************************
//***************************************************************************************
//***************************************************************************************
#endif /* STEPPER_MOTOR_H_ */