/*
 * MAIN.c
 *
 * Created: 17.05.2014 16:44:53
 *  Author: Администратор
 */ 

#include "main.h"

//****************************************************************************************
// Timer1 overflow interrupt service routine
//****************************************************************************************
ISR (TIMER1_OVF_vect)
{
	//Дана подія відбувається раз на 1с.
	//---------------------------------------------------------------------------------------
	// Reinitialize Timer1 value
	TCNT1H=0x00;//TCNT1H=0xFF;
	TCNT1L=0x23;//TCNT1L=0xDC;
	//---------------------------------------------------------------------------------------
	//Формуємо повідомлення типу :<T=+120C><H=54%><P=115kPa>
	uart_write(60);
	uart_write(84);
	uart_write(61);
	send_usart_14bit(TEMP);
	uart_write(99);
	uart_write(62);
	//---------------------------------------------------------------------------------------
	uart_write(60);
	uart_write(72);
	uart_write(61);
	send_usart_14bit(HUMID);
	uart_write(37);
	uart_write(62);
	//---------------------------------------------------------------------------------------
	uart_write(60);
	uart_write(80);
	uart_write(61);
	send_usart_14bit(PRES);
	uart_write(107);
	uart_write(80);
	uart_write(97);
	uart_write(62);
	//---------------------------------------------------------------------------------------
	return;
};
//****************************************************************************************
// Timer2 overflow interrupt service routine
//****************************************************************************************
ISR (TIMER2_OVF_vect)
{
	//Дана подія відбувається три рази на 1с.
	//---------------------------------------------------------------------------------------
	//Читаємо і розраховуєто температуру, вологість і тиск
	read_values(&TEMP,&HUMID,&PRES);
	//Обновляємо буфери індикаторів
	bin_to_bcd(TEMP,HUMID,PRES);
	//---------------------------------------------------------------------------------------
	return;
};
//****************************************************************************************
//Основна програма))))
//****************************************************************************************
int main(void)
{
	init_mcu();
	uart_init();
	//Global enable interrupts
	sei();
    while(1)
    {
		//І як воно працює???
		_delay_ms(500);
    };//while(1)
};//int main(void)
//****************************************************************************************
//Кінець основної програми
//****************************************************************************************