/*
 * meas.c
 *
 * Created: 18.10.2013 12:20:42
 *  Author: vmk
 */

#include "meas.h"

//***************************************************************************************
//Оцифровка по указаному каналу
//***************************************************************************************
unsigned int read_adc(unsigned char adc_input)
{
	unsigned int ADC_RESULT;
	ADMUX=adc_input | (ADC_VREF_TYPE & 0xff);
	// Delay needed for the stabilization of the ADC input voltage
	_delay_us(20);
	// Start the AD conversion
	ADCSRA|=0x40;
	// Wait for the AD conversion to complete
	while ((ADCSRA & 0x10)==0);
	ADCSRA|=0x10;
	ADC_RESULT=ADCL;
	ADC_RESULT=ADC_RESULT+(ADCH<<8);
	return ADC_RESULT;
};
//****************************************************************************************
//Тут проходять виміри величин
//****************************************************************************************
void read_values(signed int *TEMP,unsigned int *HUMID,unsigned int *PRES)
{
	double t=0;
	//---------------------------------------------------------------------------------------
	t=((double)read_adc(0)*5)/1024;
	*TEMP=(unsigned int)((t-0.5)/0.01);
	if ((*TEMP<(-20))||(*TEMP>120))
	{
		*TEMP=-21;
	}
	else
	{
	};
	//---------------------------------------------------------------------------------------
	t=((double)read_adc(1)*5)/1024;
	*HUMID=(unsigned int)(30.534*(t-0.8));
	if ((*HUMID<5)||(*HUMID>95))
	{
		*HUMID=0;
	}
	else
	{
	};
	//---------------------------------------------------------------------------------------
	t=((double)read_adc(2)*5)/1024;
	*PRES=(unsigned int)((t+0.475)/0.045);
	if ((*PRES<15)||(*PRES>115))
	{
		*PRES=0;
	} 
	else
	{
	};
	//---------------------------------------------------------------------------------------
};
//***************************************************************************************
//***************************************************************************************